# Task 4.9 Part 1

# 1. Import Libraries

In [1]:
# Import libraries 
import pandas as pd 
import numpy as np
import os

#Visualization Libraries
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 2. Data Import

In [2]:
path = r'/Users/jacobyount/Documents/Data Analytics/Immersion 4/02.23.2023 Instacart Basket Analysis'

In [3]:
df_customer = pd.read_csv(os.path.join(path, '2. Data', 'Raw Data', 'customers.csv'), index_col = False)

# 3. Data Exploration

In [4]:
# Checking Customers Data's Shape

df_customer.shape

(206209, 10)

In [5]:
# Checking Customers Data's info

df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [6]:
# Running basic Statistics on Customers Data set

df_customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
df_customer['Gender'].mode()

0    Male
Name: Gender, dtype: object

In [8]:
df_customer['STATE'].describe()

count      206209
unique         51
top       Florida
freq         4044
Name: STATE, dtype: object

In [9]:
df_customer['fam_status'].mode()

0    married
Name: fam_status, dtype: object

# 4. Data Wrangling

In [11]:
# Checking the data type

df_customer['user_id'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 206209 entries, 0 to 206208
Series name: user_id
Non-Null Count   Dtype
--------------   -----
206209 non-null  int64
dtypes: int64(1)
memory usage: 1.6 MB

In [12]:
# Renaming Columns. Surnam to last_name

df_customer.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [13]:
# Renaming Columns. First Name to first_name

df_customer.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [14]:
# Renaming Columns. STATE to state

df_customer.rename(columns = {'STATE' : 'state'}, inplace = True)

In [15]:
# Renaming Columns. n_dependants to num_dependants

df_customer.rename(columns = {'n_dependants' : 'num_dependants'}, inplace = True)

In [16]:
# checking changes renamed columns

df_customer.head(5)

,user_id,first_name,last_name,Gender,state,Age,date_joined,num_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
# I will be dropping the first_name and last_name columns. They aren't relevant to our final deliverable, and if the customer info is need, we can use the user_id.

df_customer = df_customer.drop(columns = ['first_name', 'last_name'])

In [18]:
df_customer.head()

,user_id,Gender,state,Age,date_joined,num_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

# 5. Data Consistency Check

In [19]:
# Checking for missing values

df_customer.isnull().sum()

user_id           0
Gender            0
state             0
Age               0
date_joined       0
num_dependants    0
fam_status        0
income            0
dtype: int64

In [20]:
# No missing values in the data set.

In [21]:
# checking for duplicate data. Creating a seperate data frame for any duplicates to address later.

df_dups = df_customer[df_customer.duplicated()]

In [22]:
df_dups

Empty DataFrame
Columns: [user_id, Gender, state, Age, date_joined, num_dependants, fam_status, income]
Index: []

In [23]:
# there are no duplicates in the customer data set

In [24]:
# exporting the wrangled customer data incase edited version is needed in the future.

df_customer.to_csv(os.path.join(path, '2. Data','Prepared Data', 'customer_wrangled.csv'))

# 6. Merge Data

In [25]:
# Importing our orders and products merged data.

ords_prods = pd.read_pickle(os.path.join(path, '2. Data', 'Prepared Data', 'ords_prods_merged_agg_var.pkl'))

In [28]:
# user_id is dtype float64. Needs to be changed to integer to merge data. 

ords_prods['user_id'].describe()

count    3.239973e+07
mean     1.029367e+05
std      5.946623e+04
min      1.000000e+00
25%      5.142000e+04
50%      1.026140e+05
75%      1.543880e+05
max      2.062090e+05
Name: user_id, dtype: float64

In [31]:
# Changing user_id in customer to float to match for merge

df_customer['user_id'] = df_customer['user_id'].astype(float)

In [32]:
# checking dtype for customer user_id
df_customer['user_id'].dtype

dtype('float64')

In [33]:
# Merging data sets using user_id as the key

ords_prods_cust = ords_prods.merge(df_customer, on = 'user_id', how ='outer')

In [34]:
# Checking to see if all merged correctly

ords_prods_cust.head(5)

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,spending_flag,median_freq,order_frequency_flag,Gender,state,Age,date_joined,num_dependants,fam_status,income
0,2539329.0,1.0,1.0,2.0,8.0,11.114836,196.0,1.0,0.0,Soda,...,low spender,20.0,regular_customer,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0
1,2398795.0,1.0,2.0,3.0,7.0,15.000000,196.0,1.0,1.0,Soda,...,low spender,20.0,regular_customer,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0
2,473747.0,1.0,3.0,3.0,12.0,21.000000,196.0,1.0,1.0,Soda,...,low spender,20.0,regular_customer,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0
3,2254736.0,1.0,4.0,4.0,7.0,29.000000,196.0,1.0,1.0,Soda,...,low spender,20.0,regular_customer,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0
4,431534.0,1.0,5.0,4.0,15.0,28.000000,196.0,1.0,1.0,Soda,...,low spender,20.0,regular_customer,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0

In [35]:
# Exporting

ords_prods_cust.to_pickle(os.path.join(path, '2. Data','Prepared Data', 'combined_data.pkl'))